In [1]:
import numpy as np
import pandas as pd

In [2]:
titanic = pd.read_csv("data.csv")
test = pd.read_csv("test.csv")
X = titanic.iloc[:, 0:10]
Y = titanic.iloc[:, -1]

In [3]:
titanic.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [4]:
del titanic['Name']
del test['Name']
titanic.head()

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,female,29.0,1,0,228414,26.000,NaN,S,1
1,3,male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,male,39.0,0,0,250655,26.000,NaN,S,0
3,3,female,29.0,0,4,349909,21.075,NaN,S,0
4,3,male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [5]:
del titanic['Ticket']
del test['Ticket']
titanic.head()

   Pclass     Sex   Age  SibSp  Parch    Fare Cabin Embarked  Survived
0       2  female  29.0      1      0  26.000   NaN        S         1
1       3    male   NaN      0      0   8.050   NaN        S         0
2       2    male  39.0      0      0  26.000   NaN        S         0
3       3  female  29.0      0      4  21.075   NaN        S         0
4       3    male  25.0      0      0   7.050   NaN        S         0

In [6]:
del titanic['Fare']
del test['Fare']
titanic.head()

   Pclass     Sex   Age  SibSp  Parch Cabin Embarked  Survived
0       2  female  29.0      1      0   NaN        S         1
1       3    male   NaN      0      0   NaN        S         0
2       2    male  39.0      0      0   NaN        S         0
3       3  female  29.0      0      4   NaN        S         0
4       3    male  25.0      0      0   NaN        S         0

In [7]:
titanic.isnull().sum()

Pclass        0
Sex           0
Age         132
SibSp         0
Parch         0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [8]:
del titanic['Cabin']
del test['Cabin']
titanic.head()

   Pclass     Sex   Age  SibSp  Parch Embarked  Survived
0       2  female  29.0      1      0        S         1
1       3    male   NaN      0      0        S         0
2       2    male  39.0      0      0        S         0
3       3  female  29.0      0      4        S         0
4       3    male  25.0      0      0        S         0

In [9]:
def getNumber(str):
    if str == 'male':
        return 1
    else :
        return 0

titanic['gender'] = titanic['Sex'].apply(getNumber)
test['gender'] = test['Sex'].apply(getNumber)
titanic.head()

   Pclass     Sex   Age  SibSp  Parch Embarked  Survived  gender
0       2  female  29.0      1      0        S         1       0
1       3    male   NaN      0      0        S         0       1
2       2    male  39.0      0      0        S         0       1
3       3  female  29.0      0      4        S         0       0
4       3    male  25.0      0      0        S         0       1

In [10]:
del titanic['Sex']
del test['Sex']

In [11]:
mean = titanic.Age.mean()
titanic.Age.fillna(mean , inplace = True)
mean

29.700559701492537

In [12]:
#finding mean survived age
mean= test.Age.mean()
test.Age.fillna(mean , inplace = True)
mean

29.694775280898877

In [13]:
def getNumber(str):
    if str == 'Q':
        return 1
    elif str =='S':
        return 2
    elif str=='C' : 
        return 3

titanic['embarked'] = titanic['Embarked'].apply(getNumber)
test['embarked'] = test['Embarked'].apply(getNumber)
titanic.head()

   Pclass       Age  SibSp  Parch Embarked  Survived  gender  embarked
0       2  29.00000      1      0        S         1       0       2.0
1       3  29.70056      0      0        S         0       1       2.0
2       2  39.00000      0      0        S         0       1       2.0
3       3  29.00000      0      4        S         0       0       2.0
4       3  25.00000      0      0        S         0       1       2.0

In [14]:
del titanic['Embarked']
del test['Embarked']

In [15]:
titanic.head()

   Pclass       Age  SibSp  Parch  Survived  gender  embarked
0       2  29.00000      1      0         1       0       2.0
1       3  29.70056      0      0         0       1       2.0
2       2  39.00000      0      0         0       1       2.0
3       3  29.00000      0      4         0       0       2.0
4       3  25.00000      0      0         0       1       2.0

In [16]:
test.head()

   Pclass        Age  SibSp  Parch  gender  embarked
0       2   8.000000      1      1       1       2.0
1       1  49.000000      0      0       0       2.0
2       3  29.694775      0      0       1       1.0
3       2  24.000000      2      1       0       2.0
4       1  36.000000      0      0       1       2.0

In [17]:
#Renaming "age" and "gender" columns
titanic.rename(columns={'gender':'Sex'}, inplace=True)
test.rename(columns={'gender':'Sex'} , inplace=True)
titanic.rename(columns={'embarked':'Embarked'}, inplace=True)
test.rename(columns={'embarked':'Embarked'} , inplace=True)
titanic.head()

   Pclass       Age  SibSp  Parch  Survived  Sex  Embarked
0       2  29.00000      1      0         1    0       2.0
1       3  29.70056      0      0         0    1       2.0
2       2  39.00000      0      0         0    1       2.0
3       3  29.00000      0      4         0    0       2.0
4       3  25.00000      0      0         0    1       2.0

In [18]:
titanic.Embarked.fillna(titanic.Embarked.mean() , inplace = True)
test.Embarked.fillna(test.Embarked.mean(),inplace = True)

In [19]:
titanic.shape

(668, 7)

In [20]:
test.shape

(223, 6)

In [21]:
survivedS = titanic[titanic.SibSp == 1][titanic.Survived == 0].shape[0]
survivedS

C:\Users\hp\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

74

In [22]:
Y = titanic['Survived']
del titanic['Survived']

In [23]:
titanic.shape

(668, 6)

In [24]:
titanic.columns , test.columns

(Index(['Pclass', 'Age', 'SibSp', 'Parch', 'Sex', 'Embarked'], dtype='object'),
 Index(['Pclass', 'Age', 'SibSp', 'Parch', 'Sex', 'Embarked'], dtype='object'))

In [25]:
titanic.isnull().sum()

Pclass      0
Age         0
SibSp       0
Parch       0
Sex         0
Embarked    0
dtype: int64

In [26]:
from sklearn import preprocessing
scaler = preprocessing.StandardScaler()
scaler.fit(titanic)
scaler.transform(test)
titanic.head()

   Pclass       Age  SibSp  Parch  Sex  Embarked
0       2  29.00000      1      0    0       2.0
1       3  29.70056      0      0    1       2.0
2       2  39.00000      0      0    1       2.0
3       3  29.00000      0      4    0       2.0
4       3  25.00000      0      0    1       2.0

In [27]:
titanic["Pclass^2"] = titanic.Pclass*titanic.Pclass
test["Pclass^2"] = test.Pclass*test.Pclass
titanic["parch^2"] = titanic.Parch*titanic.Parch
test["parch^2"] = test.Parch*test.Parch
titanic["SibSip^2"] = titanic.SibSp*titanic.SibSp
test["SibSip^2"] = test.SibSp*test.SibSp
titanic["Sex^2"] = titanic.Sex*titanic.Sex
test["Sex^2"] = test.Sex*test.Sex
titanic["x^2"] = (titanic.Parch+1)*(titanic.Sex+1)*(titanic.SibSp+1)*(titanic.Pclass+1)
test["x^2"] = (test.Parch+1)*(test.Sex+1)*(test.SibSp+1)*(test.Pclass+1)

In [46]:
from sklearn.ensemble import

In [47]:
clf = IsolationForest()

In [48]:
clf.fit(titanic , Y)
test.shape

(223, 11)

In [49]:
Y_pred = clf.predict(test)
Y_pred.resize(len(test),1)
type(Y_pred)

numpy.ndarray

In [50]:
fp = open('Prediction.csv', 'w')
for i in range(Y_pred.shape[0]):
    fp.write(str(Y_pred[i][0]) + '\n')
fp.close()

In [51]:
Y_pred.shape

(223, 1)

In [52]:
clf.score(titanic , Y)

AttributeError: 'IsolationForest' object has no attribute 'score'

In [ ]:
#clf.predict(titanic)-Y

In [ ]:
titanic.shape

In [42]:
titanic.head()

,Pclass,Age,SibSp,Parch,Sex,Embarked,Pclass^2,parch^2,SibSip^2,Sex^2,x^2
0,2,29.00000,1,0,0,2.0,4,0,1,0,6
1,3,29.70056,0,0,1,2.0,9,0,0,1,8
2,2,39.00000,0,0,1,2.0,4,0,0,1,6
3,3,29.00000,0,4,0,2.0,9,16,0,0,20
4,3,25.00000,0,0,1,2.0,9,0,0,1,8